//
//  Consts.swift
//  DegreeWork_1
//
//  Created by Yura on 24.01.2022.
//

import Foundation

class Consts {
    
    static let blue = [("Парнас", Position(35, 4)),
                       ("Пр Просвещения", Position(35, 7)),
                       ("Озерки", Position(35, 11)),
                       ("Удельная", Position(35, 15)),
                       ("Пионерская", Position(35, 18)),
                       ("Черная Речка", Position(35, 22)),
                       ("Петроградская", Position(35, 27)),
                       ("Горьковская", Position(35, 34)),
                       ("Невский пр", Position(35, 42)),
                       ("Сенная", Position(35, 48)),
                       ("Техно Инст 2", Position(35, 65)),
                       ("Фрунзенская", Position(35, 70)),
                       ("Московские Ворота", Position(35, 74)),
                       ("Электросила", Position(35, 78)),
                       ("Парк Победы", Position(35, 82)),
                       ("Московская", Position(35, 86)),
                       ("Звездная", Position(35, 90)),
                       ("Купчино", Position(35, 95))]
    
    static let green = [("Беговая", Position(7, 20)),
                        ("Зенит", Position(7, 25)),
                        ("Приморская", Position(10, 35)),
                        ("Василиостровская", Position(18, 40)),
                        ("Гостиный двор", Position(35, 42)),
                        ("Маяковская", Position(48, 42)),
                        ("Пл. А.Невского1", Position(63, 48)),
                        ("Елизаровская", Position(64, 71)),
                        ("Ломоновская", Position(64, 76)),
                        ("Пролетарская", Position(64, 83)),
                        ("Обухово", Position(64, 87)),
                        ("Рыбацкое", Position(64, 90))]
    
    static let yellow = [("Спасская", Position(35, 48)),
                         ("Достоевская", Position(48, 48)),
                         ("Лиговский пр.", Position(56, 48)),
                         ("Пл. А.Невского2", Position(63, 48)),
                         ("Новочеркасская", Position(70, 50)),
                         ("Ладожская", Position(72, 56)),
                         ("Пр Большевиков", Position(72, 62)),
                         ("Ул Дыбенко", Position(72, 67))]
    
    static let red = [("Девяткино", Position(48, 6)),
                      ("Гражданский пр", Position(48, 10)),
                      ("Академическая", Position(48, 14)),
                      ("Политехническая", Position(48, 17)),
                      ("Пл Мужества", Position(48, 20)),
                      ("Лесная", Position(48, 24)),
                      ("Выборгская", Position(48, 28)),
                      ("Пл Ленина", Position(48, 32)),
                      ("Чернышевская", Position(48, 36)),
                      ("Пл Востания", Position(48, 42)),
                      ("Владимирская", Position(48, 48)),
                      ("Пушкинская", Position(44, 55)),
                      ("Техно инст 1", Position(35, 65)),
                      ("Балтийская", Position(29, 69)),
                      ("Нарвская", Position(25, 73)),
                      ("Кировский ", Position(21, 79)),
                      ("Автово", Position(18, 83)),
                      ("Ленинский пр", Position(17, 87)),
                       ("Пр Ветеранов", Position(16, 90))]
    
    static let pink = [("Комендантский пр", Position(21, 15)),
                       ("Старая деревня", Position(21, 20)),
                       ("Крестовский остров", Position(21, 25)),
                       ("Чкаловская", Position(21, 29)),
                       ("Спортивная", Position(21, 33)),
                       ("Адмиралтейская", Position(28, 45)),
                       ("Садовая", Position(35, 48)),
                       ("Звенигородская", Position(44, 55)),
                       ("Обводный канал", Position(48, 62)),
                       ("Волковская", Position(50, 73)),
                       ("Бухарестская", Position(50, 77)),
                       ("Международная", Position(50, 82)),
                       ("Пр Славы", Position(50, 86)),
                       ("Дунайская", Position(50, 90)),
                       ("Шушары", Position(50, 94)),]
}
